Revit 2027 API
BuiltInFailures.ViewFailures.InvalidDBviewScopeBox Property
 The scope box and view must have parallel vertical axes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidDBviewScopeBox { get; }
Public Shared ReadOnly Property InvalidDBviewScopeBox As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidDBviewScopeBox {
	FailureDefinitionId^ get ();
}
static member InvalidDBviewScopeBox : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace